- 정렬과 순위
- 행의 색인이나, 열의 색인 순으로 정렬하느 등의 기준이 필요

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [3]:
df = DataFrame(np.random.randn(4,3),
               columns = list('bde'),
               index = ['Seoul', 'Busan', 'Gwangju', 'Incheon'])
format = lambda x : '%.2f' % x
df['e'].map(format)

Seoul      -0.31
Busan       1.58
Gwangju     1.26
Incheon     1.48
Name: e, dtype: object

In [6]:
s1 = df['e'].map(format)
s1.sort_index()

Busan       1.58
Gwangju     1.26
Incheon     1.48
Seoul      -0.31
Name: e, dtype: object

In [8]:
df2 = DataFrame(np.arange(8).reshape(2,4),
                index = ['three', 'one'],
                columns = ['d','a','b','c'])
df2

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [9]:
df2.sort_index() # 로우를 기준으로 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [11]:
df2.sort_index(axis = 1) # 컬럼을 기준으로 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

- 데이터는 기본적으로 오름차순으로 정렬이 된다. 내림차순으로 정렬을 할때 ascending = False 해준다.

In [13]:
df2.sort_index(axis = 1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

- 객체를 값에 따라 정렬할 경우에는 sort_values메서드를 사용한다.

In [14]:
obj = Series([4, 7, -3, 1])

obj.sort_values()

2   -3
3    1
0    4
1    7
dtype: int64

In [17]:
obj2 = Series([4, np.nan, 8, np.nan, -10, 2])
obj2.sort_values() # 빈값은 정렬시 가장 마지막에 위치한다.

4   -10.0
5     2.0
0     4.0
2     8.0
1     NaN
3     NaN
dtype: float64

In [18]:
frame = DataFrame({
    'b' : [4, 7, -5, 2],
    'a' : [0, 1, 0, 1]
})
frame

   a  b
0  0  4
1  1  7
2  0 -5
3  1  2

In [21]:
frame.sort_values(by = 'b') # by 옵셥에 정렬하고자 하는 칼럼명을 넣어준다.

   a  b
2  0 -5
3  1  2
0  0  4
1  1  7

In [24]:
frame.sort_values(by = 'a') # a컬럼의 값을 기준으로 정렬

   a  b
0  0  4
2  0 -5
1  1  7
3  1  2

In [25]:
frame.sort_values(by = ['a', 'b']) # 여러 개의 컬럼값을 기준으로 정렬

   a  b
2  0 -5
0  0  4
3  1  2
1  1  7

- 순위를 정하는 함수는 rank() 이다.

In [26]:
obj3 = Series([7, -2, 7, 4, 2, 0, 4])
obj3

0    7
1   -2
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [30]:
obj3.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [33]:
obj3.rank(method = 'first') # method='first'는 데이터의 순서에 따라 순위를 매기겠다.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [34]:
obj3.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [35]:
obj3.rank(ascending = False, method = 'first')

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [37]:
obj3.rank(ascending = False, method = 'min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64